Discriminator:


Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         (None, 196, 196, 3)       0         
_________________________________________________________________
conv2d_83 (Conv2D)           (None, 196, 196, 64)      1792      
_________________________________________________________________
leaky_re_lu_14 (LeakyReLU)   (None, 196, 196, 64)      0         
_________________________________________________________________
conv2d_84 (Conv2D)           (None, 98, 98, 64)        36928     
_________________________________________________________________
batch_normalization_74 (Batc (None, 98, 98, 64)        256       
_________________________________________________________________
leaky_re_lu_15 (LeakyReLU)   (None, 98, 98, 64)        0         
_________________________________________________________________
conv2d_85 (Conv2D)           (None, 98, 98, 128)       73856     
_________________________________________________________________
batch_normalization_75 (Batc (None, 98, 98, 128)       512       
_________________________________________________________________
leaky_re_lu_16 (LeakyReLU)   (None, 98, 98, 128)       0         
_________________________________________________________________
conv2d_86 (Conv2D)           (None, 49, 49, 128)       147584    
_________________________________________________________________
batch_normalization_76 (Batc (None, 49, 49, 128)       512       
_________________________________________________________________
leaky_re_lu_17 (LeakyReLU)   (None, 49, 49, 128)       0         
_________________________________________________________________
conv2d_87 (Conv2D)           (None, 49, 49, 256)       295168    
_________________________________________________________________
batch_normalization_77 (Batc (None, 49, 49, 256)       1024      
_________________________________________________________________
leaky_re_lu_18 (LeakyReLU)   (None, 49, 49, 256)       0         
_________________________________________________________________
conv2d_88 (Conv2D)           (None, 25, 25, 256)       590080    
_________________________________________________________________
batch_normalization_78 (Batc (None, 25, 25, 256)       1024      
_________________________________________________________________
leaky_re_lu_19 (LeakyReLU)   (None, 25, 25, 256)       0         
_________________________________________________________________
conv2d_89 (Conv2D)           (None, 25, 25, 512)       1180160   
_________________________________________________________________
batch_normalization_79 (Batc (None, 25, 25, 512)       2048      
_________________________________________________________________
leaky_re_lu_20 (LeakyReLU)   (None, 25, 25, 512)       0         
_________________________________________________________________
conv2d_90 (Conv2D)           (None, 13, 13, 512)       2359808   
_________________________________________________________________
batch_normalization_80 (Batc (None, 13, 13, 512)       2048      
_________________________________________________________________
leaky_re_lu_21 (LeakyReLU)   (None, 13, 13, 512)       0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 86528)             0         
_________________________________________________________________
dense_3 (Dense)              (None, 1024)              88605696  
_________________________________________________________________
leaky_re_lu_22 (LeakyReLU)   (None, 1024)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 1025      
_________________________________________________________________
activation_4 (Activation)    (None, 1)                 0         
=================================================================
Total params: 93,299,521
Trainable params: 93,295,809
Non-trainable params: 3,712