VGG19-54:

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_9 (InputLayer)         (None, 196, 196, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 196, 196, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 196, 196, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 98, 98, 64)        0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 98, 98, 128)       73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 98, 98, 128)       147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 49, 49, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 49, 49, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 49, 49, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 49, 49, 256)       590080    
_________________________________________________________________
block3_conv4 (Conv2D)        (None, 49, 49, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 24, 24, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 24, 24, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 24, 24, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 24, 24, 512)       2359808   
_________________________________________________________________
block4_conv4 (Conv2D)        (None, 24, 24, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 12, 12, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 12, 12, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 12, 12, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 12, 12, 512)       2359808   
_________________________________________________________________
block5_conv4 (Conv2D)        (None, 12, 12, 512)       2359808   
=================================================================
Total params: 20,024,384
Trainable params: 0
Non-trainable params: 20,024,384